#encoding:‘utf-8’
import pandas as pd
import csv
class directory:
    # 积极,有信心,充满希望
    list1=['积极','乐观','胜利','可控','进步','众志成城','一定','肯定','必将','必定','挺住','加油','决心',
           '治愈','勇敢','信心','自信','好','赢','打赢','曙光','黎明','好消息','显著','迎难而上','义无反顾',
           '稳定','缓解','打赢','过关','笑容''微笑','振奋','战胜','研制','鼓舞','赢得','康复','趋缓','出院',
           '回升','恢复','光荣','抗疫','再接再厉','愈战愈勇','同舟共济','平稳','安心','复工','复产','热烈',
            '开心','有望','好转','有效','充分','可控','斗志','尽己所能','鼓劲加油','祝福','希望','开工','工作'
           ,'有活儿干']
#担忧,紧张,质疑
    list2=['焦虑','担忧','紧急','战时状态','不够及时','哄抢','谣言','不足','紧张','不容易','不安','战时状态',
           '封城','战场','失控','缺','缺口','短缺','痛心','超过非典','牺牲','代价','吃劲','感染','病毒','盲从'
           ,'盲动','道听途说','恐慌','不幸','失误','背水一战','刻不容缓','短板','不健全','不完善','哀悼','隐患',
           '寝食难安','着急','怎么办','是否','风险','骤然','严峻','复杂','科学','理智','理性','消极','恐慌',
           '质疑','消极','不乐观','不够及时','不理睬','不配合','不实','不足','失误','谣言','传谣','信谣','质疑'
           ,'风口浪尖','不健全','不完善','怎么办','是否','究竟','着急','到底','会不会','要不要','困难','挑战',
           '问题','抱怨','物资']
#不松懈，对已取得的成功不放松警惕
    list3=['贯彻','落实','严惩','严肃','遏制','坚决','坚定','争分夺秒','紧急','战场','千方百计','毫不放松','不松懈','严阵以待','不掉以轻心',
           '慎终如始','继续','持续','严格以防','严厉','打击','再接再厉','统筹安排','谨慎','严格','稳重','不能松',
           '不能等','重视','认真','引导']
#感激，祝福，加油，支持
    list4=['一线','感激','感恩','感谢','敬佩','致敬','政策','政府','中国','党','抗疫','及时雨','最美（逆行者）'
        ,'战士','谢谢','天使','赞赏','赞扬','褒扬','感动','称赞','医者仁心','牺牲','献出','奋战','义无反顾',
        '夜以继日','最可爱的人','暖心','全民参与','全员负责','尽己所能','鼓劲','加油','祝福','希望','万众一心',
        '众志成城','无私','使命','人人有责','人人尽责','共同','支持','配合','关怀','补助','抚慰','理解','坚定'
        ,'坚持','信任','凝聚','敬意','尊敬','崇敬']

    def getdirectory(self):
        return [self.list1,self.list2,self.list3,self.list4]